# Написать программу, которая выводит на экран шахматную доску с заданным размером клеточки
for i in range(8):
    s=""
    for k in range(4):
        s+="***---"
    else:
        if not i%2: "---***"
    print(s)# 
# n=int(input("Введите ширину"))
# h=int(input("Введите высоту"))
# sim1=("*")
# sim2=("-")
# for i in range(n): #ширина
#     for j in range(h): #высота
#         for k in range(n): #ширина клеточки
#             for m in range(h): #столбик
#                 if (i+k)%2==0:
#                     print(sim1, sep="")
#                 else: 
#                     print(sim2, sep="", end="")

