# Напишите программу, которая запрашивает два целых числа x и y, после чего вычисляет и выводит
x=int(input("Введите число x: "))
y=int(input("Введите число y: "))
c=x**y
print(c)