# Пользователь вводит с клавиатуры строку. Произведите поворот строк и полученный результат выведите
str1=input("Введіть строку: ")
str2=str1[: : -1]
print(str2)