# Пользователь вводит с клавиатуры строку и символдля поиска. Посчитайте сколько раз в строке встречается
str=input("Введіть строку: ")
n=input("Введіть символ: ")
print(str.count(n))