# Пользователь вводит с клавиатуры строку и слово для поиска. Посчитайте сколько раз в строке встречается
str=input("Введіть строку: ")
word=input("Введіть слово: ")
print(str.count(word))