# Пользователь вводит с клавиатуры строку, слово для поиска, слово для замены. Произведите в строке замену
str1=input("Введіть строку: ")
word1=input("Введіть слово: ")
word2=input("Введіть слово для заміни: ")
str2=str1.replace(word1, word2)
print(str2)