# Напишите функцию, которая отображает на экран форматированный текст, указанный ниже:

def print_text():
    print("Don't let the noise of others' opinions")
    print("drown out your own inner voice.")
    print("Steve Jobs")

print_text()
